{
  "image": "/img/classes/duergar.webp",
  "title": "Skulk",
  "requirement": "Neutral alignment.",
  "fluff": "Ascending from a mysterious past, the Duergar stand as a testament to all that is strong and unyielding. With a grim and steely attitude born from the darkest depths of their homelands, they are masters of manipulation with the arts of hidden mental magics. Yet more formidable still is the hidden malice in their hearts – the threat of a swift and merciless cut, rarely seen but ever felt.",
  "hitDice": "1d4",
  "weapons": "Axes, club, crossbow, dagger, shortbow, shortsword",
  "armor": "Leather armor, mithral chainmail",
  "titles": {
    "table": {
      "table": {
        "header": ["Level", "Title"],
        "rows": [
          ["1–2", "Skulk"],
          ["3–4", "Prowler"],
          ["5–6", "Mentalist"],
          ["7–8", "Kineticist"],
          ["9–10", "Vanisher"]
        ]
      }
    },
    "reward": {
      "name": "Iron Deep.",
      "value": "Upon reaching the title of Vanisher an duergar may establish or build a Iron Deep. When the construction is complete, a number of followers will arrive to serve."
    }
  },
  "specialTalents": [
    {
      "name": "Mental Powers.",
      "description": "You can use mental powers. To use it, you mast pass an Intelligence check. Metal power lasts as long as you focus. You can't use other mental powers while focusing. To maintain mental power, make an Intelligence check at the start of your turn. If you fail the initial check, or roll natural 1 during focusing, you gain <em>mental fatigue</em> and all check to focus are now at disadvantage. If you roll natural 1 at initial check, you gain <em>mental exhaustion</em> and can't use mental powers. You loose <em>mental fatigue</em> and <em>exhaustion</em> after rest.<ul>      <li><strong>Enlargement</strong> (DC 11): Your body, clothing, and armour double in size. While enlarged, you have an advantage on attacks and checks to overcome an opposing force. Your attacks deal double damage.</li>      <li><strong>Heat</strong> (DC 11): A creature or object within near is subjected to a scorching heat. Paper or cloth ignite, liquids boil, and metals glow. Applied to flesh or to material in contact with a creature (e.g. armour), the heat inflicts 1d4 damage.</li>      <li><strong>Invisibility</strong> (DC 12): You become invisible. The invisibility breaks if you attack.</li>      <li><strong>Shrinking</strong> (DC 11): You and all your equipment shrink to 6” tall. You have an advantage on checks to be unnoticed or Dexterity checks to avoid harm. All attacks against you have disadvantage. Your weapon attacks deal half damage (minimum 1).</li>      </ul>"
    },
    {
      "name": "Stonecunning.",
      "description": "You have an advantage on checks to notice unusual stonework, such as sliding walls, stonework traps, new construction (even when built to match the old), unsafe stone surfaces, shaky stone ceilings, and the like. Something that isn't stone but that is disguised as stone also counts as unusual stonework."
    },
    {
      "name": "Cruel Stab.",
      "description": "If you hit a creature who is unaware of your attack, you deal an extra weapon die of damage."
    }
  ],
  "talents": [
    {
      "value": "2",
      "talent": "Gain advantage on checks for one mental power"
    },
    {
      "value": "3–6",
      "talent": "Your Cruel Stab deals +1 dice of damage"
    },
    {
      "value": "7–9",
      "talent": "+2 to Dexterity or Intelligence score"
    },
    {
      "value": "10–11",
      "talent": "+1 to melee attacks or +1 mental powers checks"
    },
    {
      "value": "12",
      "talent": "Choose a talent or +2 points to distribute to ability scores"
    }
  ]
}
