{
  "image": "/img/classes/druid.webp",
  "fluff": "A force of nature and protectors of balance, the Druids are enigmatic guardians of the secrets of the wild. Serving as both guide and teacher, their sagacity and wisdom flows from their deep connections with the plants and animals of the land. Honoured and respected, the Druids are forces of neutrality, forever ready to bring about harmony and understanding in times of strife.",
  "requirement": "Neutral alignment.",
  "weapons": "Club, crossbow, dagger, shortbow, staff, spear",
  "armor": "Any non metal, shield",
  "hitDice": "1d6",
  "title": "Aspirant",
  "specialTalents": [
    {
      "name": "Languages.",
      "description": "You know Druidic and Sylvan languages. All animals can understand Druidic language, but cannot respond."
    }
  ],
  "talents": [
    { "value": "2", "talent": "Gain advantage on casting one spell you know" },
    { "value": "3–6", "talent": "+1 to druid spellcasting checks" },
    { "value": "7–9", "talent": "+1 to melee attacks and damage" },
    {
      "value": "10–11",
      "talent": "+2 to Strength, Constitution or Wisdom score"
    },
    {
      "value": "12",
      "talent": "Choose a talent or +2 points to distribute to ability scores"
    }
  ],
  "titles": {
    "table": {
      "table": {
        "header": ["Level", "Title"],
        "rows": [
          ["1–2", "Aspirant"],
          ["3–4", "Ovate"],
          ["5–6", "Initiate of the Inner Circle"],
          ["7–8", "Druid"],
          ["9–10", "Hierophant"]
        ]
      }
    },
    "reward": {
      "name": "Protector of nature.",
      "value": "Achieving the title of a Hierophant grants a druid the ability to construct a Grove, with numerous followers gathering to serve the cause. Once complete, they may choose to initiate a ritual, beaconing those of like minds, and embodying the spirit of their Grove in its entirety. As such, the Grove becomes an oasis of solidarity and spiritual guidance, nurtured by the sacred and wise druid, who is revered and respected by their devoted followers."
    }
  },
  "spellcasting": {
    "description": {
      "name": "Spellcasting.",
      "description": "You can cast <a href=\"/docs/rules/spells#druid\">Druid spells</a> you know. You know two tier 1 spells of your choice from the <a href=\"/docs/rules/spells#druid\">Druid spell list</a>. Each time you gain a level, you choose new spells to learn according to the Spells Known table."
    },
    "ability": "Wisdom",
    "spellTalents": [
      {
        "name": "Animal Friendship.",
        "description": "You know the <i>animal friendship</i> spell. It doesn't count toward your number of known spells."
      }
    ],
    "spellsKnown": [
      [2, "-", "-", "-", "-"],
      [3, "-", "-", "-", "-"],
      [3, "1", "-", "-", "-"],
      [3, "2", "-", "-", "-"],
      [3, "2", "1", "-", "-"],
      [3, "2", "2", "-", "-"],
      [3, "3", "2", "1", "-"],
      [3, "3", "2", "2", "-"],
      [3, "3", "2", "2", "1"],
      [3, "3", "3", "3", "2"]
    ],
    "miscast": {
      "description": [
        {
          "name": "Involvement Rate.",
          "value": "Involvement Rate of the druid starts at 1 and increases by one every time a druid fails their spellcasting check. If the natural number on the die of the spellcasting check falls into the Involvement Rate, the spell check automatically fails, and the druid must roll on the Involvement Table. When the druid regains spells on the following day, his involvement range is reset to a 1."
        },
        {
          "name": "Ritual.",
          "value": "Once a druid's range of involvement increases beyond a natural 1, they can reduce that range by offering nature's ritual to restore nutrality."
        },
        {
          "name": "Nature's defender.",
          "value": "When a druid commits an act of damaging nature, they may incur an additional increase in his involvement range. This could amount to an increase of +1 for minor infractions all the way up to +10 for significant transgressions."
        }
      ],
      "tables": [
        {
          "name": "INVOLVEMENT",
          "description": {
            "name": "Involvement roll.",
            "value": "The roll is Involvement Rate number of d4s."
          },
          "table": {
            "header": ["Roll", "Involvement effect"],
            "rows": [
              [
                "1",
                "The druid must atone for thier involment. They must do nothing."
              ]
            ]
          }
        }
      ]
    }
  }
}
